Tekla Open API Reference for Tekla Structures 2025
SeamInputTypeAttribute Class
 The SeamInputTypeAttribute class is used for identifying that the connection is a seam and defining the input type. Based on the type the system will then ask for the correct number of input points in the creation. The attribute is initialized from the custom attribute [SeamInputType(ConnectionBase.SeamInputType.INPUT_POLYGON)] in the connection source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.SeamInputTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class SeamInputTypeAttribute : Attribute
Public NotInheritable Class SeamInputTypeAttribute
	Inherits Attribute
The SeamInputTypeAttribute type exposes the following members.
Constructors
Name | Description
SeamInputTypeAttribute(Int32)
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
SeamInputTypeAttribute(ConnectionBase.SeamInputType)
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace